In [1]:
import pandas as pd
import numpy as np
import itertools

from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression

from sklearn.metrics import roc_curve, auc
from sklearn.metrics import confusion_matrix

import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [21]:
!ls

README.md                 constituents_csv.csv      stock-fraud-predict.ipynb
all_stocks_5yr.csv        scac.csv

In [108]:
df = pd.read_csv('scac.csv')

In [109]:
df.head()

,filing_name,filing_date,district_court,exchange,ticker
0,"ILG, Inc.",07/06/2018,D. Delaware,NASDAQ,ILG
1,KLX Inc.,07/06/2018,D. Delaware,NASDAQ,KLXI
2,Triangle Capital Corporation,07/06/2018,E.D. North Carolina,New York SE,TCAP
3,Vectren Corporation,07/05/2018,S.D. Indiana,New York SE,VVC
4,DCT Industrial Trust Inc.,07/02/2018,D. Colorado,New York SE,DCT

In [110]:
df1 = pd.read_csv('all_stocks_5yr.csv')

In [111]:
df1.head()

         date   open   high    low  close    volume Name
0  2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1  2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2  2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3  2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4  2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL

In [112]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 619040 entries, 0 to 619039
Data columns (total 7 columns):
date      619040 non-null object
open      619029 non-null float64
high      619032 non-null float64
low       619032 non-null float64
close     619040 non-null float64
volume    619040 non-null int64
Name      619040 non-null object
dtypes: float64(4), int64(1), object(2)
memory usage: 33.1+ MB

In [113]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4996 entries, 0 to 4995
Data columns (total 5 columns):
filing_name       4996 non-null object
filing_date       4996 non-null object
district_court    4996 non-null object
exchange          4996 non-null object
ticker            4996 non-null object
dtypes: object(5)
memory usage: 195.2+ KB

In [114]:
df1.rename(columns={'Name':'ticker'}, inplace=True)

In [115]:
df1.head()

         date   open   high    low  close    volume ticker
0  2013-02-08  15.07  15.12  14.63  14.75   8407500    AAL
1  2013-02-11  14.89  15.01  14.26  14.46   8882000    AAL
2  2013-02-12  14.45  14.51  14.10  14.27   8126000    AAL
3  2013-02-13  14.30  14.94  14.25  14.66  10259500    AAL
4  2013-02-14  14.94  14.96  13.16  13.99  31879900    AAL

In [116]:
df['sued'] = 1

In [117]:
df.head()

,filing_name,filing_date,district_court,exchange,ticker,sued
0,"ILG, Inc.",07/06/2018,D. Delaware,NASDAQ,ILG,1
1,KLX Inc.,07/06/2018,D. Delaware,NASDAQ,KLXI,1
2,Triangle Capital Corporation,07/06/2018,E.D. North Carolina,New York SE,TCAP,1
3,Vectren Corporation,07/05/2018,S.D. Indiana,New York SE,VVC,1
4,DCT Industrial Trust Inc.,07/02/2018,D. Colorado,New York SE,DCT,1

In [118]:
#df_merge = pd.merge(df, df1, on='ticker')
df_merged = df1.merge(df,how='left', left_on='ticker', right_on='ticker')

In [119]:
df.head()

,filing_name,filing_date,district_court,exchange,ticker,sued
0,"ILG, Inc.",07/06/2018,D. Delaware,NASDAQ,ILG,1
1,KLX Inc.,07/06/2018,D. Delaware,NASDAQ,KLXI,1
2,Triangle Capital Corporation,07/06/2018,E.D. North Carolina,New York SE,TCAP,1
3,Vectren Corporation,07/05/2018,S.D. Indiana,New York SE,VVC,1
4,DCT Industrial Trust Inc.,07/02/2018,D. Colorado,New York SE,DCT,1

In [120]:
df1.head()

         date   open   high    low  close    volume ticker
0  2013-02-08  15.07  15.12  14.63  14.75   8407500    AAL
1  2013-02-11  14.89  15.01  14.26  14.46   8882000    AAL
2  2013-02-12  14.45  14.51  14.10  14.27   8126000    AAL
3  2013-02-13  14.30  14.94  14.25  14.66  10259500    AAL
4  2013-02-14  14.94  14.96  13.16  13.99  31879900    AAL

In [121]:
df_merged.head()

,date,open,high,low,close,volume,ticker,filing_name,filing_date,district_court,exchange,sued
0,2013-02-08,15.07,15.12,14.63,14.75,8407500,AAL,NaN,NaN,NaN,NaN,NaN
1,2013-02-11,14.89,15.01,14.26,14.46,8882000,AAL,NaN,NaN,NaN,NaN,NaN
2,2013-02-12,14.45,14.51,14.10,14.27,8126000,AAL,NaN,NaN,NaN,NaN,NaN
3,2013-02-13,14.30,14.94,14.25,14.66,10259500,AAL,NaN,NaN,NaN,NaN,NaN
4,2013-02-14,14.94,14.96,13.16,13.99,31879900,AAL,NaN,NaN,NaN,NaN,NaN

In [122]:
df_merged.sued.unique()

array([nan,  1.])

In [123]:
df_merged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 837587 entries, 0 to 837586
Data columns (total 12 columns):
date              837587 non-null object
open              837574 non-null float64
high              837577 non-null float64
low               837577 non-null float64
close             837587 non-null float64
volume            837587 non-null int64
ticker            837587 non-null object
filing_name       519028 non-null object
filing_date       519028 non-null object
district_court    519028 non-null object
exchange          519028 non-null object
sued              519028 non-null float64
dtypes: float64(5), int64(1), object(6)
memory usage: 83.1+ MB

In [52]:
def notSued(x):
    if type(x) is float64:
        return x
    elif x:
        return 0
    else:
        return

for i in df_merged['sued']
    if isNull(i) = True:
        df_merged['sued']=0
        
i for null(i) in df_merged['sued']

In [124]:
df_merged['sued'] = np.where(df_merged['sued']==1, 1, 0)

In [125]:
df_merged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 837587 entries, 0 to 837586
Data columns (total 12 columns):
date              837587 non-null object
open              837574 non-null float64
high              837577 non-null float64
low               837577 non-null float64
close             837587 non-null float64
volume            837587 non-null int64
ticker            837587 non-null object
filing_name       519028 non-null object
filing_date       519028 non-null object
district_court    519028 non-null object
exchange          519028 non-null object
sued              837587 non-null int64
dtypes: float64(4), int64(2), object(6)
memory usage: 83.1+ MB

In [99]:
df_merged.drop(columns='sued')

,date,open,high,low,close,volume,ticker,filing_name,filing_date,district_court,exchange,sued1
0,2013-02-08,15.07,15.1200,14.6300,14.75,8407500,AAL,NaN,NaN,NaN,NaN,0
1,2013-02-11,14.89,15.0100,14.2600,14.46,8882000,AAL,NaN,NaN,NaN,NaN,0
2,2013-02-12,14.45,14.5100,14.1000,14.27,8126000,AAL,NaN,NaN,NaN,NaN,0
3,2013-02-13,14.30,14.9400,14.2500,14.66,10259500,AAL,NaN,NaN,NaN,NaN,0
4,2013-02-14,14.94,14.9600,13.1600,13.99,31879900,AAL,NaN,NaN,NaN,NaN,0
5,2013-02-15,13.93,14.6100,13.9300,14.50,15628000,AAL,NaN,NaN,NaN,NaN,0
6,2013-02-19,14.33,14.5600,14.0800,14.26,11354400,AAL,NaN,NaN,NaN,NaN,0
7,2013-02-20,14.17,14.2600,13.1500,13.33,14725200,AAL,NaN,NaN,NaN,NaN,0
8,2013-02-21,13.62,13.9500,12.9000,13.37,11922100,AAL,NaN,NaN,NaN,NaN,0
9,2013-02-22,13.57,13.6000,13.2100,13.57,6071400,AAL,NaN,NaN,NaN,NaN,0
10,2013-02-25,13.60,13.7600,13.0000,13.02,7186400,AAL,NaN,NaN,NaN,NaN,0
11,2013-02-26,13.14,13.4200,12.7000,13.26,9419000,AAL,NaN,NaN,NaN,NaN,0
12,2013-02-27,13.28,13.6200,13.1800,13.41,7390500,AAL,NaN,NaN,NaN,NaN,0
13,2013-02-28,13.49,13.6300,13.3900,13.43,6143600,AAL,NaN,NaN,NaN,NaN,0
14,2013-03-01,13.37,13.9500,13.3200,13.61,7376800,AAL,NaN,NaN,NaN,NaN,0
15,2013-03-04,13.50,14.0700,13.4700,13.90,8174800,AAL,NaN,NaN,NaN,NaN,0
16,2013-03-05,14.01,14.0500,13.7100,14.05,7676100,AAL,NaN,NaN,NaN,NaN,0
17,2013-03-06,14.52,14.6800,14.2500,14.57,13243200,AAL,NaN,NaN,NaN,NaN,0
18,2013-03-07,14.70,14.9300,14.5000,14.82,9125300,AAL,NaN,NaN,NaN,NaN,0
19,2013-03-08,14.99,15.2000,14.8400,14.92,10593700,AAL,NaN,NaN,NaN,NaN,0
20,2013-03-11,14.85,15.1500,14.7100,15.13,6961800,AAL,NaN,NaN,NaN,NaN,0
21,2013-03-12,15.14,15.6000,14.9500,15.50,8999100,AAL,NaN,NaN,NaN,NaN,0
22,2013-03-13,15.54,16.2000,15.4800,15.91,11380000,AAL,NaN,NaN,NaN,NaN,0
23,2013-03-14,15.98,16.3600,15.9300,16.25,8383300,AAL,NaN,NaN,NaN,NaN,0
24,2013-03-15,16.45,16.5400,15.8800,15.98,17667700,AAL,NaN,NaN,NaN,NaN,0
25,2013-03-18,15.80,16.3300,15.7100,16.29,6514100,AAL,NaN,NaN,NaN,NaN,0
26,2013-03-19,16.48,16.8500,16.4100,16.78,11805300,AAL,NaN,NaN,NaN,NaN,0
27,2013-03-20,17.13,17.3300,16.8700,17.23,10819800,AAL,NaN,NaN,NaN,NaN,0
28,2013-03-21,17.21,17.4300,16.8700,17.00,10740800,AAL,NaN,NaN,NaN,NaN,0
29,2013-03-22,17.10,17.2900,16.7700,16.86,8545200,AAL,NaN,NaN,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...
837557,2017-12-26,72.40,72.5500,71.9000,72.34,792134,ZTS,NaN,NaN,NaN,NaN,0
837558,2017-12-27,72.59,72.6900,72.2500,72.45,1159771,ZTS,NaN,NaN,NaN,NaN,0
837559,2017-12-28,72.49,72.6000,72.1400,72.39,710499,ZTS,NaN,NaN,NaN,NaN,0
837560,2017-12-29,72.55,72.7600,72.0400,72.04,1704122,ZTS,NaN,NaN,NaN,NaN,0
837561,2018-01-02,72.54,72.5900,71.4650,71.77,2135564,ZTS,NaN,NaN,NaN,NaN,0
837562,2018-01-03,71.77,72.1800,71.3400,72.10,2328506,ZTS,NaN,NaN,NaN,NaN,0
837563,2018-01-04,72.75,72.9128,72.2600,72.53,2534010,ZTS,NaN,NaN,NaN,NaN,0
837564,2018-01-05,72.83,73.9200,72.5700,73.36,2166065,ZTS,NaN,NaN,NaN,NaN,0
837565,2018-01-08,73.43,74.4200,73.1607,74.24,3631552,ZTS,NaN,NaN,NaN,NaN,0
837566,2018-01-09,74.70,75.4750,74.4650,75.11,2721946,ZTS,NaN,NaN,NaN,NaN,0
837567,2018-01-10,74.58,74.8000,73.2800,73.91,2257464,ZTS,NaN,NaN,NaN,NaN,0
837568,2018-01-11,74.05,74.6800,73.7200,74.59,1629279,ZTS,NaN,NaN,NaN,NaN,0
837569,2018-01-12,74.91,75.6900,74.7700,75.39,1915669,ZTS,NaN,NaN,NaN,NaN,0
837570,2018-01-16,76.06,76.4000,75.2100,75.54,2599094,ZTS,NaN,NaN,NaN,NaN,0
837571,2018-01-17,75.81,77.0300,75.3900,76.77,2769587,ZTS,NaN,NaN,NaN,NaN,0
837572,2018-01-18,76.65,76.6500,75.8500,76.33,2588995,ZTS,NaN,NaN,NaN,NaN,0
837573,2018-01-19,76.69,76.9100,76.2200,76.62,4829602,ZTS,NaN,NaN,NaN,NaN,0
837574,2018-01-22,76.67,77.5800,76.6200,77.48,4195103,ZTS,NaN,NaN,NaN,NaN,0
837575,2018-01-23,77.30,78.3200,76.9700,77.59,2264132,ZTS,NaN,NaN,NaN,NaN,0
837576,2018-01-24,78.16,78.5100,77.6000,78.33,2585326,ZTS,NaN,NaN,NaN,NaN,0
837577,2018-01-25,78.47,79.3800,78.3450,79.25,2327262,ZTS,NaN,NaN,NaN,NaN,0
837578,2018-01-26,79.49,80.1300,79.3800,80.09,2532808,ZTS,NaN,NaN,NaN,NaN,0
837579,2018-01-29,79.81,79.9500,79.1100,79.18,2662383,ZTS,NaN,NaN,NaN,NaN,0
837580,2018-01-30,78.44,78.6900,77.9100,78.35,3808707,ZTS,NaN,NaN,NaN,NaN,0
837581,2018-01-31,78.49,78.7700,76.5400,76.73,4136360,ZTS,NaN,NaN,NaN,NaN,0
837582,2018-02-01,76.84,78.2700,76.6900,77.82,2982259,ZTS,NaN,NaN,NaN,NaN,0
837583,2018-02-02,77.53,78.1200,76.7300,76.78,2595187,ZTS,NaN,NaN,NaN,NaN,0
837584,2018-02-05,76.64,76.9200,73.1800,73.83,2962031,ZTS,NaN,NaN,NaN,NaN,0
837585,2018-02-06,72.74,74.5600,72.1300,73.27,4924323,ZTS,NaN,NaN,NaN,NaN,0
837586,2018-02-07,72.70,75.0000,72.6900,73.86,4534912,ZTS,NaN,NaN,NaN,NaN,0

In [100]:
df_merged.rename(columns={'sued1': 'sued'}, inplace=True)

In [101]:
df_merged.exchange.value_counts()

New York SE         378430
NASDAQ              135562
American SE           2518
Privately Traded      1259
ETF                   1259
Name: exchange, dtype: int64

In [102]:
df_merged.filing_name.value_counts()

Juniper Networks, Inc.                                                                                               6295
Chesapeake Energy Corporation                                                                                        5036
General Electric Company                                                                                             5036
Medtronic, Inc.                                                                                                      5036
Advanced Micro Devices, Inc.                                                                                         3777
Merck & Co., Inc.                                                                                                    3777
Aetna Inc.                                                                                                           3777
American Express Company                                                                                             3777
Johnson & Johnson                                                                                                    3777
The Boeing Company                                                                                                   3777
General Motors Company                                                                                               3777
Facebook, Inc.                                                                                                       3777
Boston Scientific Corporation                                                                                        3777
Ford Motor Company                                                                                                   3777
Chipotle Mexican Grill, Inc.                                                                                         3777
Lockheed Martin Corporation                                                                                          3777
Xerox Corporation                                                                                                    3777
Express Scripts Holding Company                                                                                      2518
State Street Corporation                                                                                             2518
The Western Union Company                                                                                            2518
Edison International                                                                                                 2518
Regions Financial Corporation                                                                                        2518
Amgen, Inc.                                                                                                          2518
E*TRADE Financial Corporation                                                                                        2518
The Coca-Cola Company                                                                                                2518
ConAgra Foods, Inc.                                                                                                  2518
American Electric Power Company, Inc.                                                                                2518
NVIDIA Corporation                                                                                                   2518
Mattel, Inc.                                                                                                         2518
Equinix, Inc.                                                                                                        2518
                                                                                                                     ...
J.P. Morgan Chase & Co. and J.P. Morgan Securities Inc.                                                              1259
AvantGo Inc.                                                                                                         1259
FirstEnergy Corporation                                                                                              1259
Prudential Financial, Inc.                                                                                           1259
CMS Energy Corporation                                                                                               1259
FMR Corporation, Fidelity Management & Research Company and Fidelity Magellan Fund : Micron Technology Inc. Stock    1259
Mylan Laboratories, Inc.                                                                                             1259
Corning Inc.                                                                                                         1259
Arconic Inc.                                                                                                         1259
UnumProvident Corporation                                                                                            1259
Salomon Smith Barney, Inc./Citigroup : AT&T; Corporation and AT&T; Wireless                                          1259
Bank of America Corporation                                                                                          1259
Wells Fargo & Company                                                                                                1259
General Growth Properties, Inc.                                                                                      1259
Vivendi Universal, S.A. : American Depository Receipts (ADRs)                                                        1259
Bristol-Myers Squibb Company (2002)                                                                                  1257
Bristol-Myers Squibb Company (2000)                                                                                  1257
EnergySolutions, Inc.                                                                                                1249
Coty Inc.                                                                                                            1173
News Corporation                                                                                                     1169
Fox Entertainment Group, Inc. : News Corporation                                                                     1169
Foxmeyer Health Corporation                                                                                          1169
NaviSite, Inc.                                                                                                        960
Citizens Financial Group, Inc.                                                                                        850
Hewlett Packard Company                                                                                               581
CSRA, Inc.                                                                                                            561
Willis Towers Watson plc                                                                                              528
Under Armour, Inc.                                                                                                    464
Envision Healthcare Holdings, Inc.                                                                                    297
Envision Healthcare Corporation                                                                                       297
Name: filing_name, Length: 323, dtype: int64

In [127]:
from datetime import datetime

In [128]:
df_merged.filing_date = pd.to_datetime(df_merged['filing_date'])

In [130]:
df_merged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 837587 entries, 0 to 837586
Data columns (total 12 columns):
date              837587 non-null object
open              837574 non-null float64
high              837577 non-null float64
low               837577 non-null float64
close             837587 non-null float64
volume            837587 non-null int64
ticker            837587 non-null object
filing_name       519028 non-null object
filing_date       519028 non-null datetime64[ns]
district_court    519028 non-null object
exchange          519028 non-null object
sued              837587 non-null int64
dtypes: datetime64[ns](1), float64(4), int64(2), object(5)
memory usage: 83.1+ MB

In [131]:
df_sectors = pd.read_csv('constituents_csv.csv')

In [132]:
df_sectors.head()

  Symbol                 Name                  Sector
0    MMM           3M Company             Industrials
1    AOS      A.O. Smith Corp             Industrials
2    ABT  Abbott Laboratories             Health Care
3   ABBV          AbbVie Inc.             Health Care
4    ACN        Accenture plc  Information Technology

In [133]:
df_sectors.rename(columns={'Symbol':'ticker'}, inplace=True)

In [134]:
df_sectors.head()

  ticker                 Name                  Sector
0    MMM           3M Company             Industrials
1    AOS      A.O. Smith Corp             Industrials
2    ABT  Abbott Laboratories             Health Care
3   ABBV          AbbVie Inc.             Health Care
4    ACN        Accenture plc  Information Technology

In [135]:
df_merged2 = df_merged.merge(df_sectors,how='left', left_on='ticker', right_on='ticker')
#df_merge2 = pd.merge(df_merge, df_sectors, on='ticker')

In [137]:
df_merged2.head()

,date,open,high,low,close,volume,ticker,filing_name,filing_date,district_court,exchange,sued,Name,Sector
0,2013-02-08,15.07,15.12,14.63,14.75,8407500,AAL,NaN,NaT,NaN,NaN,0,American Airlines Group,Industrials
1,2013-02-11,14.89,15.01,14.26,14.46,8882000,AAL,NaN,NaT,NaN,NaN,0,American Airlines Group,Industrials
2,2013-02-12,14.45,14.51,14.10,14.27,8126000,AAL,NaN,NaT,NaN,NaN,0,American Airlines Group,Industrials
3,2013-02-13,14.30,14.94,14.25,14.66,10259500,AAL,NaN,NaT,NaN,NaN,0,American Airlines Group,Industrials
4,2013-02-14,14.94,14.96,13.16,13.99,31879900,AAL,NaN,NaT,NaN,NaN,0,American Airlines Group,Industrials

In [138]:
df_merged2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 837587 entries, 0 to 837586
Data columns (total 14 columns):
date              837587 non-null object
open              837574 non-null float64
high              837577 non-null float64
low               837577 non-null float64
close             837587 non-null float64
volume            837587 non-null int64
ticker            837587 non-null object
filing_name       519028 non-null object
filing_date       519028 non-null datetime64[ns]
district_court    519028 non-null object
exchange          519028 non-null object
sued              837587 non-null int64
Name              822479 non-null object
Sector            822479 non-null object
dtypes: datetime64[ns](1), float64(4), int64(2), object(7)
memory usage: 95.9+ MB

In [140]:
df_merged2.Sector.value_counts()

Financials                    137479
Health Care                   130185
Information Technology        122571
Consumer Discretionary        121198
Industrials                   101845
Consumer Staples               47152
Energy                         41699
Utilities                      41537
Real Estate                    41531
Materials                      30987
Telecommunication Services      6295
Name: Sector, dtype: int64

In [141]:
df_sector = pd.get_dummies(df_merged2['Sector'])

In [142]:
df_final = pd.concat([df_merged2, df_sector], axis=1)

In [143]:
df_final.columns

Index(['date', 'open', 'high', 'low', 'close', 'volume', 'ticker',
       'filing_name', 'filing_date', 'district_court', 'exchange', 'sued',
       'Name', 'Sector', 'Consumer Discretionary', 'Consumer Staples',
       'Energy', 'Financials', 'Health Care', 'Industrials',
       'Information Technology', 'Materials', 'Real Estate',
       'Telecommunication Services', 'Utilities'],
      dtype='object')

In [145]:
df_final.head()

,date,open,high,low,close,volume,ticker,filing_name,filing_date,district_court,...,Consumer Staples,Energy,Financials,Health Care,Industrials,Information Technology,Materials,Real Estate,Telecommunication Services,Utilities
0,2013-02-08,15.07,15.12,14.63,14.75,8407500,AAL,NaN,NaT,NaN,...,0,0,0,0,1,0,0,0,0,0
1,2013-02-11,14.89,15.01,14.26,14.46,8882000,AAL,NaN,NaT,NaN,...,0,0,0,0,1,0,0,0,0,0
2,2013-02-12,14.45,14.51,14.10,14.27,8126000,AAL,NaN,NaT,NaN,...,0,0,0,0,1,0,0,0,0,0
3,2013-02-13,14.30,14.94,14.25,14.66,10259500,AAL,NaN,NaT,NaN,...,0,0,0,0,1,0,0,0,0,0
4,2013-02-14,14.94,14.96,13.16,13.99,31879900,AAL,NaN,NaT,NaN,...,0,0,0,0,1,0,0,0,0,0

In [146]:
df_final.district_court.value_counts()

S.D. New York          117356
N.D. California         63481
D. New Jersey           27397
C.D. California         25761
N.D. Illinois           22662
D. Massachusetts        22662
D. Minnesota            18885
D. Connecticut          16367
S.D. Ohio               12590
E.D. Missouri           11331
E.D. Michigan           11331
D. Colorado             10369
N.D. Georgia            10072
D. Delaware              9773
E.D. Pennsylvania        8813
S.D. California          8813
M.D. Tennessee           7851
W.D. Washington          7554
S.D. Florida             7554
N.D. Texas               7464
N.D. Ohio                6295
E.D. New York            6295
W.D. Oklahoma            5036
D. Nevada                4338
E.D. Virginia            4305
S.D. Indiana             3777
D. Rhode Island          3777
E.D. Tennessee           3777
S.D. Texas               3777
W.D. Kentucky            3777
W.D. Missouri            3777
D. Oregon                2518
N.D. Alabama             2518
M.D. Florida             2518
D. Nebraska              2518
E.D. Wisconsin           2518
W.D. Arkansas            2518
W.D. Pennsylvania        2518
D. Maine                 2518
D. South Carolina        2518
D. Maryland              1723
N.D. Oklahoma            1259
M.D. North Carolina      1259
N.D. Indiana             1259
N.D. Iowa                1259
W.D. New York            1259
W.D. Texas               1259
W.D. Michigan            1259
D. Arizona               1259
S.D. Illinois            1259
W.D. Wisconsin           1259
M.D. Georgia             1259
W.D. North Carolina      1259
E.D. Arkansas            1259
D. Idaho                 1259
Name: district_court, dtype: int64

In [147]:
df_final.head()

,date,open,high,low,close,volume,ticker,filing_name,filing_date,district_court,...,Consumer Staples,Energy,Financials,Health Care,Industrials,Information Technology,Materials,Real Estate,Telecommunication Services,Utilities
0,2013-02-08,15.07,15.12,14.63,14.75,8407500,AAL,NaN,NaT,NaN,...,0,0,0,0,1,0,0,0,0,0
1,2013-02-11,14.89,15.01,14.26,14.46,8882000,AAL,NaN,NaT,NaN,...,0,0,0,0,1,0,0,0,0,0
2,2013-02-12,14.45,14.51,14.10,14.27,8126000,AAL,NaN,NaT,NaN,...,0,0,0,0,1,0,0,0,0,0
3,2013-02-13,14.30,14.94,14.25,14.66,10259500,AAL,NaN,NaT,NaN,...,0,0,0,0,1,0,0,0,0,0
4,2013-02-14,14.94,14.96,13.16,13.99,31879900,AAL,NaN,NaT,NaN,...,0,0,0,0,1,0,0,0,0,0

In [149]:
df_final.describe()

,open,high,low,close,volume,sued,Consumer Discretionary,Consumer Staples,Energy,Financials,Health Care,Industrials,Information Technology,Materials,Real Estate,Telecommunication Services,Utilities
count,837574.000000,837577.000000,837577.000000,837587.000000,8.375870e+05,837587.000000,837587.000000,837587.000000,837587.000000,837587.000000,837587.000000,837587.000000,837587.000000,837587.000000,837587.000000,837587.000000,837587.000000
mean,83.500098,84.267744,82.720669,83.519700,6.110539e+06,0.619671,0.144699,0.056295,0.049785,0.164137,0.155429,0.121593,0.146338,0.036996,0.049584,0.007516,0.049591
std,106.820307,107.744581,105.852739,106.831904,1.303700e+07,0.485468,0.351797,0.230491,0.217500,0.370400,0.362313,0.326816,0.353445,0.188751,0.217084,0.086366,0.217099
min,1.620000,1.690000,1.500000,1.590000,0.000000e+00,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,37.710000,38.070000,37.340000,37.705000,1.197900e+06,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,60.460000,61.030000,59.900000,60.490000,2.456047e+06,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,93.290000,94.120000,92.490000,93.330000,5.500547e+06,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,2044.000000,2067.990000,2035.110000,2049.000000,6.182376e+08,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000